MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV44F128VLF16/mcu.h
/*! @name SEL14 - Crossbar A Select Register 14 */
/*! @{ */
#define XBARA_SEL14_SEL28_MASK                   (0x3FU)
#define XBARA_SEL14_SEL28_SHIFT                  (0U)
/*! SEL28
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XBARIN2 input pin
 *  0b000011..XBARIN3 input pin
 *  0b000100..XBARIN4 input pin
 *  0b000101..XBARIN5 input pin
 *  0b000110..XBARIN6 input pin
 *  0b000111..XBARIN7 input pin
 *  0b001000..XBARIN8 input pin
 *  0b001001..XBARIN9 input pin
 *  0b001010..XBARIN10 input pin
 *  0b001011..XBARIN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100001..ADC converter A end of scan
 *  0b100011..ADC converter B end of scan
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101101..ENC0 compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 */
#define XBARA_SEL14_SEL28(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL14_SEL28_SHIFT)) & XBARA_SEL14_SEL28_MASK)
#define XBARA_SEL14_SEL29_MASK                   (0x3F00U)
#define XBARA_SEL14_SEL29_SHIFT                  (8U)
/*! SEL29
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XBARIN2 input pin
 *  0b000011..XBARIN3 input pin
 *  0b000100..XBARIN4 input pin
 *  0b000101..XBARIN5 input pin
 *  0b000110..XBARIN6 input pin
 *  0b000111..XBARIN7 input pin
 *  0b001000..XBARIN8 input pin
 *  0b001001..XBARIN9 input pin
 *  0b001010..XBARIN10 input pin
 *  0b001011..XBARIN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100001..ADC converter A end of scan
 *  0b100011..ADC converter B end of scan
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101101..ENC0 compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 */
#define XBARA_SEL14_SEL29(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL14_SEL29_SHIFT)) & XBARA_SEL14_SEL29_MASK)
/*! @} */

/*! @name SEL15 - Crossbar A Select Register 15 */
/*! @{ */
#define XBARA_SEL15_SEL30_MASK                   (0x3FU)
#define XBARA_SEL15_SEL30_SHIFT                  (0U)
/*! SEL30
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XBARIN2 input pin
 *  0b000011..XBARIN3 input pin
 *  0b000100..XBARIN4 input pin
 *  0b000101..XBARIN5 input pin
 *  0b000110..XBARIN6 input pin
 *  0b000111..XBARIN7 input pin
 *  0b001000..XBARIN8 input pin
 *  0b001001..XBARIN9 input pin
 *  0b001010..XBARIN10 input pin
 *  0b001011..XBARIN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100001..ADC converter A end of scan
 *  0b100011..ADC converter B end of scan
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101101..ENC0 compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 */
#define XBARA_SEL15_SEL30(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL15_SEL30_SHIFT)) & XBARA_SEL15_SEL30_MASK)
#define XBARA_SEL15_SEL31_MASK                   (0x3F00U)
#define XBARA_SEL15_SEL31_SHIFT                  (8U)
/*! SEL31
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XBARIN2 input pin
 *  0b000011..XBARIN3 input pin
 *  0b000100..XBARIN4 input pin
 *  0b000101..XBARIN5 input pin
 *  0b000110..XBARIN6 input pin
 *  0b000111..XBARIN7 input pin
 *  0b001000..XBARIN8 input pin
 *  0b001001..XBARIN9 input pin
 *  0b001010..XBARIN10 input pin
 *  0b001011..XBARIN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100001..ADC converter A end of scan
 *  0b100011..ADC converter B end of scan
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101101..ENC0 compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 */
#define XBARA_SEL15_SEL31(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL15_SEL31_SHIFT)) & XBARA_SEL15_SEL31_MASK)
/*! @} */

