MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV44F128VLF16/mcu.h
/*! @name SEL4 - Crossbar B Select Register 4 */
/*! @{ */
#define XBARB_SEL4_SEL8_MASK                     (0x1FU)
#define XBARB_SEL4_SEL8_SHIFT                    (0U)
/*! SEL8
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL4_SEL8(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL4_SEL8_SHIFT)) & XBARB_SEL4_SEL8_MASK)
#define XBARB_SEL4_SEL9_MASK                     (0x1F00U)
#define XBARB_SEL4_SEL9_SHIFT                    (8U)
/*! SEL9
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL4_SEL9(x)                       (((uint16_t)(((uint16_t)(x)) << XBARB_SEL4_SEL9_SHIFT)) & XBARB_SEL4_SEL9_MASK)
/*! @} */

/*! @name SEL5 - Crossbar B Select Register 5 */
/*! @{ */
#define XBARB_SEL5_SEL10_MASK                    (0x1FU)
#define XBARB_SEL5_SEL10_SHIFT                   (0U)
/*! SEL10
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL5_SEL10_SHIFT)) & XBARB_SEL5_SEL10_MASK)
#define XBARB_SEL5_SEL11_MASK                    (0x1F00U)
#define XBARB_SEL5_SEL11_SHIFT                   (8U)
/*! SEL11
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL5_SEL11_SHIFT)) & XBARB_SEL5_SEL11_MASK)
/*! @} */

/*! @name SEL6 - Crossbar B Select Register 6 */
/*! @{ */
#define XBARB_SEL6_SEL12_MASK                    (0x1FU)
#define XBARB_SEL6_SEL12_SHIFT                   (0U)
/*! SEL12
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL6_SEL12_SHIFT)) & XBARB_SEL6_SEL12_MASK)
#define XBARB_SEL6_SEL13_MASK                    (0x1F00U)
#define XBARB_SEL6_SEL13_SHIFT                   (8U)
/*! SEL13
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL6_SEL13(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL6_SEL13_SHIFT)) & XBARB_SEL6_SEL13_MASK)
/*! @} */

/*! @name SEL7 - Crossbar B Select Register 7 */
/*! @{ */
#define XBARB_SEL7_SEL14_MASK                    (0x1FU)
#define XBARB_SEL7_SEL14_SHIFT                   (0U)
/*! SEL14
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL7_SEL14(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL7_SEL14_SHIFT)) & XBARB_SEL7_SEL14_MASK)
#define XBARB_SEL7_SEL15_MASK                    (0x1F00U)
#define XBARB_SEL7_SEL15_SHIFT                   (8U)
/*! SEL15
 *  0b00000..CMP0 Output
 *  0b00001..CMP1 Output
 *  0b00010..CMP2 Output
 *  0b00011..CMP3 Output
 *  0b01000..PWMA channel 0 trigger 0 or trigger 1
 *  0b01001..PWMA channel 1 trigger 0 or trigger 1
 *  0b01010..PWMA channel 2 trigger 0 or trigger 1
 *  0b01011..PWMA channel 3 trigger 0 or trigger 1
 *  0b01100..PDB0 channel 0 output trigger
 *  0b01101..ADC converter A end of scan
 *  0b01110..XBARIN2 input pin
 *  0b01111..XBARIN3 input pin
 *  0b10010..DMA channel 0 done
 *  0b10011..DMA channel 1 done
 *  0b10100..XBARIN10 input pin
 *  0b10101..XBARIN11 input pin
 *  0b10110..DMA channel 6 done
 *  0b10111..DMA channel 7 done
 *  0b11000..PIT trigger 0
 *  0b11001..PIT trigger 1
 *  0b11010..PDB1 channel 0 output trigger
 *  0b11011..ADC converter B end of scan
 */
#define XBARB_SEL7_SEL15(x)                      (((uint16_t)(((uint16_t)(x)) << XBARB_SEL7_SEL15_SHIFT)) & XBARB_SEL7_SEL15_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XBARB_Register_Masks */


/* XBARB - Peripheral instance base addresses */
/** Peripheral XBARB base address */
#define XBARB_BASE                               (0x4005A000u)
/** Peripheral XBARB base pointer */
#define XBARB                                    ((XBARB_Type *)XBARB_BASE)
/** Array initializer of XBARB peripheral base addresses */
#define XBARB_BASE_ADDRS                         { XBARB_BASE }
/** Array initializer of XBARB peripheral base pointers */
#define XBARB_BASE_PTRS                          { XBARB }

/*!
 * @}
 */ /* end of group XBARB_Peripheral_Access_Layer */


